Introdução ao Pandas II

In [3]:
# Importando a biblioteca Pandas

import pandas as pd 

# Mapear o caminho e nome do documento

path = 'C:\\Users\\FIC\\Documents\\Luiz Antonio Python\\003 - Arquivos\\'
file = 'bank-full.xlsx'

# Abrindo o documento e atribuindo a um dataframe
df = pd.read_excel(path + file, sheet_name= 'Sheet 1 - bank-full')

# Visualizar 

df.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome
0,58,management,married,tertiary,no,2143,yes,no,unknown,5,may,261,1,-1,0,unknown
1,44,technician,single,secondary,no,29,yes,no,unknown,5,may,151,1,-1,0,unknown
2,33,entrepreneur,married,secondary,no,2,yes,yes,unknown,5,may,76,1,-1,0,unknown
3,47,blue-collar,married,unknown,no,1506,yes,no,unknown,5,may,92,1,-1,0,unknown
4,33,unknown,single,unknown,no,1,no,no,unknown,5,may,198,1,-1,0,unknown

In [4]:
df['balance'].mean()

1362.2720576850766

In [6]:
media = df['balance'].mean()

# A função round trata valores, ajustando o número de casas decimais
# round(number, number_for_digits)

round(media,0)

1362.0

Calculando a média de mais de uma coluna

In [9]:
# Para selecionar mais de uma coluna . você deve passar uma lista contendo os nomes
#das colunas do dataframe --> Exemplo : dataframe [[lista]]

df[['balance','duration']].mean()

balance     1362.272058
duration     258.163080
dtype: float64

#### Soma (sum)

Quando precisamos saber a soma dos valores de uma determinada variável,
podemos usar a função pd.sum().

In [10]:
df.balance.sum()

61589682

In [11]:
df.duration.sum()

11671811

In [13]:
# É soma de uma lista de variáveis (colunas)

df[['pdays','duration','balance']].sum()

pdays        1817384
duration    11671811
balance     61589682
dtype: int64

### Unique e Nunique

unique- nos mostra todos os valores únicos de uma coluna

nunique- nos mostra a quantidade de elementos únicos em uma coluna

In [15]:
# Comando unique

df.job.unique()

array(['management', 'technician', 'entrepreneur', 'blue-collar',
       'unknown', 'retired', 'admin.', 'services', 'self-employed',
       'unemployed', 'housemaid', 'student'], dtype=object)

In [16]:
# Comando nunique

df.job.nunique()

12

###  Dados duplicados

A quantidade de elementos duplicados em uma coluna

In [17]:
df.job.duplicated()

0        False
1        False
2        False
3        False
4        False
         ...
45206     True
45207     True
45208     True
45209     True
45210     True
Name: job, Length: 45211, dtype: bool

In [18]:
df.job.duplicated().sum()

45199

A quantidade de elementos duplicados em uma tabela

In [19]:
df.duplicated().sum()

0

Identificar os valores duplicados

In [20]:
df.loc[df.duplicated()==True]

Empty DataFrame
Columns: [age, job, marital, education, default, balance, housing, loan, contact, day, month, duration, campaign, pdays, previous, poutcome]
Index: []